from math import sqrt

x1 = float(input("Введіть координати точки х1: "))
y1 = float(input("Введіть координати точки y1: "))  # точка А

x2 = float(input("Введіть координати точки х2: "))
y2 = float(input("Введіть координати точки y2: "))  # точка В

x3 = float(input("Введіть координати точки х3: "))
y3 = float(input("Введіть координати точки y3: "))  # точка С

AB = sqrt(((x2 - x1) ** 2) * ((y2 - y1) ** 2))
AC = sqrt(((x3 - x1) ** 2) * ((y3 - y1) ** 2))
BC = sqrt(((x3 - x3) ** 2) * ((y3 - y2) ** 2))
if AC==AB==AC:
    print("трикутник рівносторонній")
else:
    print("трикутник не рівносторонній")

